IDEA Connection Link
ConnectionSrv Class
 ConnectionSrv
Inheritance Hierarchy
System.Object
 IdeaRS.ConnectionService.Service.ConnectionSrv
 Namespace: IdeaRS.ConnectionService.Service
 Assembly: IdeaRS.ConnectionLink (in IdeaRS.ConnectionLink.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public class ConnectionSrv
Public Class ConnectionSrv
public ref class ConnectionSrv
The ConnectionSrv type exposes the following members.
Constructors
Name | Description
ConnectionSrv
Initializes a new instance of the ConnectionSrv class
Top
Properties
Name | Description
CalculationTimeLimit
 Get or set time limit for creating report (or CBFEM calculation)
ConDataContract
 ConDataContract
ConnProviderService
 ConnProviderService
IdeaProject
 return IIdeaProject
ProgressCallback
 ProgressCallback
Top
Methods
Name | Description
CalculateProject
 CalculateProject
CloseServices
 CloseServices
Equals
Determines whether the specified object is equal to the current object.
 (Inherited from Object.)
Finalize
Allows an object to try to free resources and perform other cleanup operations before it is reclaimed by garbage collection.
 (Inherited from Object.)
GetConnectionModel
 GetConnectionModel
GetConnectionModelDesktop
 GetConnectionModelDesktop
GetConnectionResultsData
 GetConnectionResultsData
GetDetailedConResultsData
 Get detailed results of checks
GetDetailedConResultsJSON
 Get detailed results of checks inJSOM
GetHashCode
Serves as the default hash function.
 (Inherited from Object.)
GetNonconformities
 Get all nonconformities for connection
GetResultFile
 GetResultFile
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetWeldStress
 Weld curve for weld ID and connection
GetWeldUid
 Weld id from connection model
ImportFromIOM(Byte[])
 ImportFromIOM
ImportFromIOM(OpenModel, OpenModelResult)
 ImportFromIOM
MemberwiseClone
Creates a shallow copy of the current Object.
 (Inherited from Object.)
OpenConnectionService
 Open connection project from data contract
OpenIdeaConProjectFile
 OpenIdeaConProjectFile
OpenIdeaConProjectFileAndResultFile
 OpenIdeaConProjectFileAndResultFile
ReadFully
 ReadFully
SaveIdeaConToProjectFile
 SaveIdeaConToProjectFile
SaveResultToFile
 SaveResultToFile
SetAndOpenIdeaConProjectFile
 OpenIdeaConProjectFile
SetAndOpenIdeaConProjectFileAndResultFile
 OpenIdeaConProjectFileAndResultFile
StreamToByteArray
 StreamToByteArray
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Top
Fields
Name | Description
AppTempDir
 Main app working dir
Top
See Also
Reference
IdeaRS.ConnectionService.Service Namespace